app/Http/Controllers/Api/AttactiveController.php

    public function update(AttractiveUpdateRequest $request, $id)
    {
        $attrractive=AttractiveLocation::find($id);
---
select * from `attractive_locations` where `attractive_locations`.`id` = '1' limit 1